from utils import *

PROV = 'Foshan_Guangdong_msb_20230823'

FILE_NAMES = ['043205附件3.监督抽检不合格产品信息.xls', '044031附件3.监督抽检不合格产品信息.xls',
              '044320附件2.专项抽检合格产品信息.xls', '044743附件2.监督抽检合格产品信息.xls',
              '045516附件2.监督抽检合格产品信息.xls', '045947附件3.专项抽检不合格产品信息.xls',
              '050124附件3.监督抽检不合格产品信息.xls', '050154附件2.监督抽检合格产品信息.xls',
              '050700附件3.监督抽检不合格产品信息.xls', '050911附件4.专项抽检不合格产品信息.xls',
              '050940附件3.监督抽检不合格产品信息.xls', '051316附件2.专项抽检合格产品信息.xlsx',
              '051722附件2.专项抽检合格产品信息.xls', '051817附件3.专项抽检不合格产品信息.xlsx',
              '051915附件4.专项抽检不合格产品信息.xls', '052341附件2.监督抽检合格产品信息.xls',
              '052815附件2.监督抽检合格产品信息.xls', '052948附件2.专项抽检合格产品信息.xls',
              '053755附件3._监督抽检不合格产品信息.xlsx', '0545112.监督抽检合格产品信息.xls',
              '054704监督抽检合格产品信息.xls', '2.监督抽检合格产品信息.xls', '监督抽检不合格产品信息.xlsx',
              '附件2.监督抽检合格产品信息..xlsx', '附件2_专项抽检产品信息.xls']

FILE_NUM = 2

col_headers = '序号	标识生产企业名称	标识生产企业地址	被抽样单位名称	被抽样单位地址	样品名称	规格型号	商标	生产日期/批号	不合格项目║检验结果║标准值	分类	公告号	检验机构	备注'

parsed_df, raw_df = init(PROV, FILE_NAMES, FILE_NUM, col_headers)

if df_exists(raw_df):
    parsed_df, raw_df = remove_common_cols(parsed_df, raw_df)

results(parsed_df, raw_df)
